{"pageProps":{"post":{"attributes":{"description":"Learn a few things about running Redis and how you as a coder can maximize your effectiveness with Redis."},"html":"<p>Similar to Neo4j, I personally haven&#39;t done much administration of Redis but a lot of ther principles are the same. Redis has a primary secondary configuration as well. Their preferred terms are leader and follower (they also used to be master/slave but have since changed it so you may still see that in old documentation and StackOverflow answers.)</p>\n<p>The leader server will accept all writes and then write those out to the followers so that all followers are exact replicas of the leader. If a leader and follower (also sometimes called replica) loses track of each other, the followers are smart enough to request the delta of changes when the follower reconnects. If a follower cannot figure out the delta, it just drops everything and totally resyncs. So this is to say you can always read from a follower with full confidence because it won&#39;t give you a response without confidence it&#39;s correct.</p>\n<p>The exception to the above is that it&#39;s technically possible in Redis&#39;s default configuration that in the split second between a write to the leader and the read from a follower you could get the previous data (a.k.a. eventual consistency.) This is usually an acceptable tradeoff because it&#39;s usually lightning fast but sometimes that might not be enough. You can change it so Redis will write to the leader and all its followers before it will finish writing, therefore guaranteeing consistency.</p>\n<p>You can also use a WAIT command with Redis to tell it to wait for a highly important command to wait until it&#39;s been replicated. I&#39;ve never used it.</p>\n<h2>Redis Cluster</h2>\n<p>Remember talking about MongoDB&#39;s sharding? The same thing is available to Redis via Redis Cluster. This will take your keys and shard them out amongst multiple different pockets of replicated leaders and followers. While this will increase the complexity of your Redis service and makes your Redis deployment <em>less consistent</em> (mean it has higher dangers of dropping writes) you greatly increase how much Redis can scale. This is how you handle terabytes and petabytes of data.</p>\n<h2>Redis Sentinel</h2>\n<p>A very cool feature set provided by the purveyors of Redis, Redis Labs. Redis Sentinenal is a service where it will monitor the health of all your Redis servers, will notify you if a server is unhealthy, and will begin failovers if a service becomes unhealthy that you don&#39;t have any down time. It can even kick off a new deploy of a new Redis server, restore itself from Redis, and automatically start serving traffic. This often called a <em>self-healing</em> capability or a <em>highly available</em> service.</p>\n<p>A big key with Sentinenel is that you want these servers to live in ways that would fail independently. If all of your servers are running the same region of a cloud provider, if that region goes down then sentinel isn&#39;t going to much help you. But if you spread them out amongst regions you can survive even regional downtimes!</p>\n","markdown":"\nSimilar to Neo4j, I personally haven't done much administration of Redis but a lot of ther principles are the same. Redis has a primary secondary configuration as well. Their preferred terms are leader and follower (they also used to be master/slave but have since changed it so you may still see that in old documentation and StackOverflow answers.)\n\nThe leader server will accept all writes and then write those out to the followers so that all followers are exact replicas of the leader. If a leader and follower (also sometimes called replica) loses track of each other, the followers are smart enough to request the delta of changes when the follower reconnects. If a follower cannot figure out the delta, it just drops everything and totally resyncs. So this is to say you can always read from a follower with full confidence because it won't give you a response without confidence it's correct.\n\nThe exception to the above is that it's technically possible in Redis's default configuration that in the split second between a write to the leader and the read from a follower you could get the previous data (a.k.a. eventual consistency.) This is usually an acceptable tradeoff because it's usually lightning fast but sometimes that might not be enough. You can change it so Redis will write to the leader and all its followers before it will finish writing, therefore guaranteeing consistency.\n\nYou can also use a WAIT command with Redis to tell it to wait for a highly important command to wait until it's been replicated. I've never used it.\n\n## Redis Cluster\n\nRemember talking about MongoDB's sharding? The same thing is available to Redis via Redis Cluster. This will take your keys and shard them out amongst multiple different pockets of replicated leaders and followers. While this will increase the complexity of your Redis service and makes your Redis deployment _less consistent_ (mean it has higher dangers of dropping writes) you greatly increase how much Redis can scale. This is how you handle terabytes and petabytes of data.\n\n## Redis Sentinel\n\nA very cool feature set provided by the purveyors of Redis, Redis Labs. Redis Sentinenal is a service where it will monitor the health of all your Redis servers, will notify you if a server is unhealthy, and will begin failovers if a service becomes unhealthy that you don't have any down time. It can even kick off a new deploy of a new Redis server, restore itself from Redis, and automatically start serving traffic. This often called a _self-healing_ capability or a _highly available_ service.\n\nA big key with Sentinenel is that you want these servers to live in ways that would fail independently. If all of your servers are running the same region of a cloud provider, if that region goes down then sentinel isn't going to much help you. But if you spread them out amongst regions you can survive even regional downtimes!\n","slug":"redis-ops","title":"Redis Ops","section":"Key Value Store","icon":"info-circle","filePath":"/home/runner/work/complete-intro-to-databases-v2/complete-intro-to-databases-v2/lessons/05-key-value-store/G-redis-ops.md","nextSlug":"/lessons/conclusion/conclusion","prevSlug":"/lessons/key-value-store/nodejs-app-with-redis"}},"__N_SSG":true}